In [1]:
import numpy as np
import pandas as pd
from sklearn.model_selection import train_test_split

In [2]:
df = pd.read_csv('income_evaluation.csv', na_values='?')

In [3]:
df.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,income
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [4]:
df[' education'].unique()

array([' Bachelors', ' HS-grad', ' 11th', ' Masters', ' 9th',
       ' Some-college', ' Assoc-acdm', ' Assoc-voc', ' 7th-8th',
       ' Doctorate', ' Prof-school', ' 5th-6th', ' 10th', ' 1st-4th',
       ' Preschool', ' 12th'], dtype=object)

In [5]:
df.isna().sum()

age                0
 workclass         0
 fnlwgt            0
 education         0
 education-num     0
 marital-status    0
 occupation        0
 relationship      0
 race              0
 sex               0
 capital-gain      0
 capital-loss      0
 hours-per-week    0
 native-country    0
 income            0
dtype: int64

In [6]:
# hours per week
np.random.seed(0)
h = np.random.choice(a=df.index, replace=False, size=20)
df.loc[h, ' hours-per-week'] = np.nan

In [7]:
# age
np.random.seed(seed=10)
a = np.random.choice(a=df.index, replace=False, size=28)
df.loc[a, 'age'] = np.nan

In [8]:
df.isna().sum()

age                28
 workclass          0
 fnlwgt             0
 education          0
 education-num      0
 marital-status     0
 occupation         0
 relationship       0
 race               0
 sex                0
 capital-gain       0
 capital-loss       0
 hours-per-week    20
 native-country     0
 income             0
dtype: int64

In [9]:
x_train, x_test, y_train, y_test = train_test_split(df.drop(' income', 1), df[' income'],
                                                    test_size=0.2, random_state=5)

In [10]:
from sklearn.impute import KNNImputer

In [11]:
knn = KNNImputer(n_neighbors=5, add_indicator=True)

In [12]:
x_train['age'].dtypes

dtype('float64')

In [13]:
x_train.columns

Index(['age', ' workclass', ' fnlwgt', ' education', ' education-num',
       ' marital-status', ' occupation', ' relationship', ' race', ' sex',
       ' capital-gain', ' capital-loss', ' hours-per-week', ' native-country'],
      dtype='object')

In [14]:
# getting only numerical columns
num = [col for col in x_train.columns if x_train[col].dtypes != 'O']

In [15]:
x_train[num].head()

,age,fnlwgt,education-num,capital-gain,capital-loss,hours-per-week
21425,55.0,238216,9,0,0,40.0
28707,24.0,306460,9,0,0,40.0
4455,48.0,213140,4,0,0,40.0
2231,36.0,127306,13,0,0,40.0
18864,53.0,103586,13,0,0,55.0

In [16]:
knn.fit(x_train[num])

KNNImputer(add_indicator=True)

In [17]:
knn.transform(x_train[num])

array([[5.50000e+01, 2.38216e+05, 9.00000e+00, ..., 4.00000e+01,
        0.00000e+00, 0.00000e+00],
       [2.40000e+01, 3.06460e+05, 9.00000e+00, ..., 4.00000e+01,
        0.00000e+00, 0.00000e+00],
       [4.80000e+01, 2.13140e+05, 4.00000e+00, ..., 4.00000e+01,
        0.00000e+00, 0.00000e+00],
       ...,
       [8.50000e+01, 1.66027e+05, 9.00000e+00, ..., 5.00000e+01,
        0.00000e+00, 0.00000e+00],
       [3.60000e+01, 4.69056e+05, 9.00000e+00, ..., 2.50000e+01,
        0.00000e+00, 0.00000e+00],
       [2.60000e+01, 1.98163e+05, 1.40000e+01, ..., 4.00000e+01,
        0.00000e+00, 0.00000e+00]])

In [20]:
pd.DataFrame(knn.transform(x_train[num])).isna().sum().sum()

0

In [21]:
pd.DataFrame(knn.transform(x_train[num])).head()

      0         1     2    3    4     5    6    7
0  55.0  238216.0   9.0  0.0  0.0  40.0  0.0  0.0
1  24.0  306460.0   9.0  0.0  0.0  40.0  0.0  0.0
2  48.0  213140.0   4.0  0.0  0.0  40.0  0.0  0.0
3  36.0  127306.0  13.0  0.0  0.0  40.0  0.0  0.0
4  53.0  103586.0  13.0  0.0  0.0  55.0  0.0  0.0

In [23]:
# subsetting only to give numerical values
x_test[num]

,age,fnlwgt,education-num,capital-gain,capital-loss,hours-per-week
32264,32.0,260954,7,0,2042,30.0
28024,31.0,236391,10,0,0,40.0
9347,59.0,175689,10,0,0,14.0
10427,37.0,114765,10,0,0,40.0
4810,40.0,179717,13,0,1564,60.0
...,...,...,...,...,...,...
22533,48.0,125892,5,0,0,40.0
934,37.0,186934,7,3103,0,44.0
6546,26.0,177482,12,0,0,45.0
31812,47.0,258498,10,0,0,52.0
8192,45.0,160962,10,0,0,35.0

In [24]:
x_test[num].isna().sum()

age                5
 fnlwgt            0
 education-num     0
 capital-gain      0
 capital-loss      0
 hours-per-week    1
dtype: int64

In [31]:
pd.DataFrame(knn.transform(x_test[num])).isna().sum().sum()

0